Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/timer_reg.h
    /* 0x74  reserved */
    uint8_t RESERVED0x74[4];

    /* 0x78 : TICR2 */
    union {
        struct
        {
            uint32_t tclr_0        : 1;  /* [    0],          w,        0x0 */
            uint32_t tclr_1        : 1;  /* [    1],          w,        0x0 */
            uint32_t tclr_2        : 1;  /* [    2],          w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TICR2;

    /* 0x7C : TICR3 */
    union {
        struct
        {
            uint32_t tclr_0        : 1;  /* [    0],          w,        0x0 */
            uint32_t tclr_1        : 1;  /* [    1],          w,        0x0 */
            uint32_t tclr_2        : 1;  /* [    2],          w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TICR3;

    /* 0x80 : WICR */
    union {
        struct
        {
            uint32_t wiclr         : 1;  /* [    0],          w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WICR;

    /* 0x84 : TCER */
    union {
        struct
        {
            uint32_t reserved_0    : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t timer2_en     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t timer3_en     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TCER;

    /* 0x88 : TCMR */
    union {
        struct
        {
            uint32_t reserved_0    : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t timer2_mode   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t timer3_mode   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TCMR;

    /* 0x8c  reserved */
    uint8_t RESERVED0x8c[4];

    /* 0x90 : TILR2 */
    union {
        struct
        {
            uint32_t tilr_0        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tilr_1        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tilr_2        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TILR2;

    /* 0x94 : TILR3 */
    union {
        struct
        {
            uint32_t tilr_0        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tilr_1        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tilr_2        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } TILR3;

    /* 0x98 : WCR */
    union {
        struct
        {
            uint32_t wcr           : 1;  /* [    0],          w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WCR;

    /* 0x9C : WFAR */
    union {
        struct
        {
            uint32_t wfar           : 16; /* [15: 0],          w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WFAR;

    /* 0xA0 : WSAR */
    union {
        struct
        {
            uint32_t wsar           : 16; /* [15: 0],          w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WSAR;

    /* 0xa4  reserved */
    uint8_t RESERVED0xa4[4];

    /* 0xA8 : TCVWR2 */
    union {
        struct
        {
            uint32_t tcvwr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } TCVWR2;

    /* 0xAC : TCVWR3 */
    union {
        struct
        {
            uint32_t tcvwr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } TCVWR3;

    /* 0xb0  reserved */
    uint8_t RESERVED0xb0[4];

    /* 0xB4 : TCVSYN2 */
    union {
        struct
        {
            uint32_t tcvsyn2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } TCVSYN2;

    /* 0xB8 : TCVSYN3 */
    union {
        struct
        {
            uint32_t tcvsyn3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } TCVSYN3;

    /* 0xBC : TCDR */
    union {
        struct
        {
            uint32_t reserved_0_7 : 8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t tcdr2        : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t tcdr3        : 8; /* [23:16],        r/w,        0x0 */
            uint32_t wcdr         : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } TCDR;
};

typedef volatile struct timer_reg timer_reg_t;

#endif /* __TIMER_REG_H__ */
